BotTest/src/DataProcessors/ОбновитьТокены/ОбновитьТокены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбновитьТокены</name>
</mdclass:DataProcessor>

BotTest/src/InformationRegisters/ДанныеПодключенияСРМ/ДанныеПодключенияСРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПодключенияСРМ</name>
  <resources>
    <name>СикретКей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИДИнеграции</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АуфКод</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АксесТокен</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РефрешТокен</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Субдомен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BotTest/src/DataProcessors/ОбновитьТокены/Forms/ОбновитьТокены/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеПодключенияСРМ.АксесТокен,
	|	ДанныеПодключенияСРМ.Субдомен,
	|	ДанныеПодключенияСРМ.СикретКей,
	|	ДанныеПодключенияСРМ.ИДИнеграции,
	|	ДанныеПодключенияСРМ.РефрешТокен
	|ИЗ
	|	РегистрСведений.ДанныеПодключенияСРМ КАК ДанныеПодключенияСРМ";
	Выборка = Запрос.Выполнить().Выбрать();
	Запись = РегистрыСведений.ДанныеПодключенияСРМ.СоздатьМенеджерЗаписи();
	Пока Выборка.Следующий() Цикл
		СубдоменТекущий = Выборка.Субдомен;
		АксесТекущий = Выборка.АксесТокен;
		СикретКейТекущий = Выборка.СикретКей;
		ИДИнтеграцииТекущий = Выборка.ИДИнеграции;
		РефрешТекущий = Выборка.РефрешТокен;
		
		JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	Данные = Новый Структура;
	Данные.Вставить("client_id", ИДИнтеграцииТекущий);
	Данные.Вставить("client_secret", СикретКейТекущий);
	Данные.Вставить("grant_type", "refresh_token");
	Данные.Вставить("refresh_token", РефрешТекущий);
	Данные.Вставить("redirect_uri", "https://google.com");
	
	ЗаписатьJSON(JSONЗапрос, Данные);
    СтрокаJS = JSONЗапрос.Закрыть();
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("Authorization", "Bearer " + АксесТекущий);
	
	//АдресРесурса = СтрСоединить(ПараметрыЗапроса, "&");
	АдресРесурса = "/oauth2/access_token"; 	
	 
	Соединение = Новый HTTPСоединение(СубдоменТекущий + ".amocrm.ru", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL() );
	
    
    Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
    Запрос.УстановитьТелоИзСтроки(СтрокаJS);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос); 
    ОкноОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
    
    ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(ОкноОтвета);
    ЗаписьТокен = 0;
    Пока ЧтениеJSON.Прочитать() Цикл
    	Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства ИЛИ ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Строка Тогда
	    	Если ЧтениеJSON.ТекущееЗначение = "access_token" Или ЧтениеJSON.ТекущееЗначение = "refresh_token" Тогда
	    		Если ЗаписьТокен = 1 Тогда
	    			ЗаписьТокен = 2;
	    		Иначе
	    			ЗаписьТокен = 1;
	    		КонецЕсли;
	    	КонецЕсли;
	    	Если НЕ ЧтениеJSON.ТекущееЗначение = "access_token" И НЕ ЧтениеJSON.ТекущееЗначение = "refresh_token" Тогда
	    		Если ЗаписьТокен = 1 Тогда
	    			НовыйАксес = ЧтениеJSON.ТекущееЗначение;
	    		КонецЕсли;
	    		Если ЗаписьТокен = 2 Тогда
	    			НовыйРефреш = ЧтениеJSON.ТекущееЗначение;
	    		КонецЕсли;
	    	КонецЕсли;
    	КонецЕсли;
    	
    КонецЦикла;
    
	Запись = РегистрыСведений.ДанныеПодключенияСРМ.СоздатьМенеджерЗаписи();
	Запись.АксесТокен = АксесТекущий;
	Запись.Субдомен = СубдоменТекущий;
	Запись.СикретКей = СикретКейТекущий;
	Запись.ИДИнеграции = ИДИнтеграцииТекущий;
	Запись.РефрешТокен = РефрешТекущий;
	Запись.Прочитать();
	Запись.АксесТокен = НовыйАксес;
	Запись.РефрешТокен = НовыйРефреш;
	Запись.Записать();
	
    ЧтениеJSON.Закрыть();
		
	КонецЦикла;
КонецПроцедуры
